#### Terraform Initialization ⚙️`success`
#### Terraform Plan `success`
<details><summary>Show Plan</summary>
```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.github_actions_in_action_ecr.aws_ecr_lifecycle_policy.ecr_lifecycle_policy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m      = jsonencode(
            {
              [32m+[0m [0mrules = [
                  [32m+[0m [0m{
                      [32m+[0m [0maction       = {
                          [32m+[0m [0mtype = "expire"
                        }
                      [32m+[0m [0mdescription  = "Expire untagged images older than 1 day"
                      [32m+[0m [0mrulePriority = 1
                      [32m+[0m [0mselection    = {
                          [32m+[0m [0mcountNumber = 1
                          [32m+[0m [0mcountType   = "sinceImagePushed"
                          [32m+[0m [0mcountUnit   = "days"
                          [32m+[0m [0mtagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      [32m+[0m [0m[1m[0mregistry_id[0m[0m = (known after apply)
    }

[1m  # module.github_actions_in_action_ecr.aws_ecr_repository.ecr_repository[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ecr_repository" "ecr_repository" {
      [32m+[0m [0m[1m[0marn[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mimage_tag_mutability[0m[0m = "MUTABLE"
      [32m+[0m [0m[1m[0mregistry_id[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mrepository_url[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                 = {
          [32m+[0m [0m"maintainer" = "taufort"
          [32m+[0m [0m"project"    = "github-actions-in-action"
        }

      [32m+[0m [0mimage_scanning_configuration {
          [32m+[0m [0m[1m[0mscan_on_push[0m[0m = true
        }
    }

[1m  # module.github_actions_in_action_ecr.aws_ecr_repository_policy.ecr_repository_policy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ecr_repository_policy" "ecr_repository_policy" {
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m      = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = [
                          [32m+[0m [0m"ecr:UploadLayerPart",
                          [32m+[0m [0m"ecr:SetRepositoryPolicy",
                          [32m+[0m [0m"ecr:PutImage",
                          [32m+[0m [0m"ecr:ListImages",
                          [32m+[0m [0m"ecr:InitiateLayerUpload",
                          [32m+[0m [0m"ecr:GetRepositoryPolicy",
                          [32m+[0m [0m"ecr:GetDownloadUrlForLayer",
                          [32m+[0m [0m"ecr:DescribeRepositories",
                          [32m+[0m [0m"ecr:DeleteRepositoryPolicy",
                          [32m+[0m [0m"ecr:DeleteRepository",
                          [32m+[0m [0m"ecr:CompleteLayerUpload",
                          [32m+[0m [0m"ecr:BatchGetImage",
                          [32m+[0m [0m"ecr:BatchDeleteImage",
                          [32m+[0m [0m"ecr:BatchCheckLayerAvailability",
                        ]
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mAWS = "448878779811"
                        }
                      [32m+[0m [0mSid       = "ECRPolicy"
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mregistry_id[0m[0m = (known after apply)
    }

[0m[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.[0m

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @taufort, Action: `pull_request`*